<a href="https://colab.research.google.com/github/Ashlay01/Ash21212022/blob/main/test_db.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import sqlite3

conn = sqlite3.connect("test.db")

In [3]:
cur = conn.cursor()

In [4]:
sql = """
CREATE TABLE IF NOT EXISTS users(
  userid INT PRIMARY KEY,
  fname TEXT,
  lname TEXT,
  superhero TEXT,
  gender TEXT);
"""

# Execute query
cur.execute(sql)

In [5]:
sql='''
PRAGMA table_info('users');
'''

cur.execute(sql)
cur.fetchall()

[(0, 'userid', 'INT', 0, None, 1),
 (1, 'fname', 'TEXT', 0, None, 0),
 (2, 'lname', 'TEXT', 0, None, 0),
 (3, 'superhero', 'TEXT', 0, None, 0),
 (4, 'gender', 'TEXT', 0, None, 0)]

In [6]:
#Create a second table in the database 
sql = """
CREATE TABLE IF NOT EXISTS film(
  filmid INT PRIMARY KEY,
  filmName TEXT,
  filmDescription TEXT,
  filmRating INT,
  filmProducer TEXT);
  """
cur.execute(sql)

In [7]:
#Check schema of database
sql = """
Select name
FROM sqlite_master
WHERE type = 'table';
"""
cur.execute(sql)
cur.fetchall()

[('users',), ('film',)]

In [8]:
sql='''
PRAGMA table_info('film');
'''

cur.execute(sql)
cur.fetchall()

[(0, 'filmid', 'INT', 0, None, 1),
 (1, 'filmName', 'TEXT', 0, None, 0),
 (2, 'filmDescription', 'TEXT', 0, None, 0),
 (3, 'filmRating', 'INT', 0, None, 0),
 (4, 'filmProducer', 'TEXT', 0, None, 0)]

In [9]:
#insert data into table
sql = """
INSERT INTO users
VALUES (1, 'ASH', 'NSL', 'MALE', 'X-Men');
"""

cur.execute(sql)

In [10]:
#check whether data has been inserted into table users
sql = """
SELECT *
FROM users;
"""

cur.execute(sql)
cur.fetchall()

[(1, 'ASH', 'NSL', 'MALE', 'X-Men')]

In [11]:
#fetching data from table users
sql = """
SELECT *
FROM users;
"""

rows = cur.execute(sql)

for row in rows:
  print(row)

(1, 'ASH', 'NSL', 'MALE', 'X-Men')

In [12]:
#inserting many values in the database
many_values = [(2, "WAWA", "ASH", "BEBE", "xxx"), (3, "NSL", "SAS", "SMC", "ddd")]

sql = """
INSERT INTO users
VALUES (?,?,?,?,?)
"""
cur.executemany(sql, many_values)

In [13]:
#fetching data from table users
sql = """
SELECT *
FROM users;
"""

rows = cur.execute(sql)

for row in rows:
  print(row)

(1, 'ASH', 'NSL', 'MALE', 'X-Men')
(2, 'WAWA', 'ASH', 'BEBE', 'xxx')
(3, 'NSL', 'SAS', 'SMC', 'ddd')

In [15]:
#validate and comfirm the changes
conn.commit()

In [14]:
#fetch all from table users
sql = """
SELECT *
FROM users
"""

cur.execute(sql)
rows = cur.fetchall()

for row in rows:
  print(row)

(1, 'ASH', 'NSL', 'MALE', 'X-Men')
(2, 'WAWA', 'ASH', 'BEBE', 'xxx')
(3, 'NSL', 'SAS', 'SMC', 'ddd')

In [16]:
#fetch a specific data from the table 
sql = """
SELECT *
FROM users
WHERE lname = "ASH";
"""

cur.execute(sql)
cur.fetchall()

[(2, 'WAWA', 'ASH', 'BEBE', 'xxx')]

In [17]:
#fetch a specific data from the table 
sql = """
SELECT *
FROM users
WHERE lname = "NSL";
"""

cur.execute(sql)
cur.fetchall()

[(1, 'ASH', 'NSL', 'MALE', 'X-Men')]

In [18]:
#delete data from table
sql = """
DELETE
FROM users
WHERE lname = "NSL";
"""

cur.execute(sql)

In [19]:
#check if data has been deleted 
sql = """
SELECT *
FROM users
WHERE lname = "NSL";
"""

cur.execute(sql)
cur.fetchall()

[]

In [20]:
#using pandas library to read database
import pandas as pd

sql ='''
SELECT * from users;
'''
# LOAD the data into a DataFrame
users_df = pd.read_sql_query(sql, conn)
users_df

   userid fname lname superhero gender
0       2  WAWA   ASH      BEBE    xxx
1       3   NSL   SAS       SMC    ddd

In [27]:
sql = """
INSERT INTO users
VALUES (4, "NSL", "ASH", null, null);
"""

cur.execute(sql)

In [28]:
#cleaning null values from dataframe
clean = users_df.dropma()
clean

AttributeError: ignored

In [31]:
#Select only data for males 
users_male_df = users_df[users_df.gender == 'males']

# Write the new Dataframe to a new SQlite table 
users_male_df.to_sql("Males", conn, if_exists="replace")

0

In [33]:
#drop table
sql='''
DROP TABLE IF EXISTS gender;
'''
cur.execute(sql)
cur.fetchall()

[]